conv = """가. 102관
1. 맥도날드 중앙대점
1.	위치
102관 지하 1층
2.	종류
식당(햄버거, 스낵, 음료수)
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구
있다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
배리어프리하다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
6.	키오스크
배리어프리한 키오스크가 세 대 존재한다, 이 중 한 대는 장애인 우선이용 키오스크이다
2. 홍당무
1.	위치
102관 지하 1층
2.	종류
식당(분식)
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 슬라이딩 도어 존재
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
맨 우측 벽에 붙어있는 의자 제외 모두 이동 가능하다
2)	조명 밝기
약간 어둡다
3)	내부공간(eg. 테이블 사이 통로)
테이블 사이 통로가 좁다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
6.	키오스크
키오스크가 한 대 존재하나, 배리어프리한 키오스크가 아니다
3. 북촌순두부&주꾸미
1.	위치
102관 지하 1층
2.	종류
식당(한식)
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구
없다
4.	내부
1)	의자 이동 가능 여부
맨 안쪽 테이블 4개 제외 이동 가능하다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이 통로가 좁다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
4. 중앙대학교 구내서점
1.	위치
102관 지하 1층
2.	종류
서점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
중고등 학습서 진열대 주변 통로가 좁다, 나머지는 양호하다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
5. 모닝글로리 중앙대 1호점
1.	위치
102관 지하 1층
2.	종류
문구점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 자동문이다 (수동식)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
진열대 사이 통로가 좁다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
6. 블루포트
1.	위치
102관 지하 1층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
모두 이동이 가능하다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
테이블 사이 통로가 좁다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
6.	키오스크
키오스크가 한 대 존재하나, 배리어프리한 키오스크가 아니다
7. LOGO SHOP
1.	위치
102관 지하 1층
2.	종류
기념품점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
모두 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
배리어프리하다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
8. 우리은행
1.	위치
102관 지하 1층
2.	종류
은행
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
대기석(소파)은 이동 불가능한데, 상담석은 모두 이동 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
배리어프리하다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
9. UNIVERSITY CLUB
1.	위치
102관 11층
2.	종류
구내식당
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 자동문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
모두 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블 사이 통로가 좁다
5.	장애인화장실 여부
102관 내부 지하 1층 남녀 장애인 화장실 존재한다, 우리은행과 맥도날드 사이에 남녀 장애인 화장실 존재하지만, 장애인용 칸이 존재하지 않는다
나. 301관
1. 블루포트
1.	위치
301관 3층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 개방되어 있다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이의 통로가 좁지만 대체로 휠체어가 지나다니기에 공간이 충분히 넓다
5.	장애인화장실 여부
301관 3층에 남녀 장애인 화장실이 존재하지만, 카페와 화장실을 잇는 통로에 계단이 존재한다. 따라서 화장실에 가려면 301관 우측 출입구 경사로로 나가서 303관 좌측 출입구 경사로로 들어와야 한다
6.	키오스크
키오스크가 1대 존재하지만 배리어프리한 키오스크가 아니다
다. 303관
1. Cafe Dream
1.	위치
303관 6층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 개방되어 있다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블이 없다, 픽업하는 곳이 휠체어를 탄 상태로 이용하기에는 높다
5.	장애인화장실 여부
303관 6층에 남녀 장애인 화장실이 존재한다
6.	키오스크
키오스크 2대가 존재하지만, 배리어프리한 키오스크가 아니다
2. 법학관 식당
1.	위치
303관 지하 1층
2.	종류
식당
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 미는 문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구 여부
한 개 존재하지만, 별도 출입구로 들어오려면 계단을 지나야 한다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이의 통로가 좁지만, 대체로 휠체어가 지나다니기에 공간이 충분히 넓다
5.	장애인화장실 여부
303관 지하 1층에 남녀 장애인 화장실이 존재한다
6.	키오스크
키오스크가 세 대 존재하나 모두 배리어프리한 키오스크가 아니다
라. 308관
1. 308관 식당
1.	위치
308관 지하 1층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 개방되어 있다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블이 없다, 픽업하는 곳이 휠체어를 탄 상태로 이용하기에는 높다
5.	장애인화장실 여부
308관 지하 1층에 남녀 장애인 화장실이 존재한다
6.	키오스크
키오스크 2대가 존재하지만, 배리어프리한 키오스크가 아니다
2. 발도스 커피
1.	위치
308관 지하 1층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 미는 문이고 영업시간에는 문이 개방되어 있다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 가게 바깥에 있다, 모두 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블이 가게 바깥에 있다, 테이블 사이 통로가 좁다
5.	장애인화장실 여부
308관 지하 1층에 남녀 장애인 화장실이 존재한다
6.	키오스크
키오스크 2대가 존재하지만, 배리어프리한 키오스크가 아니다
3. CU
1.	위치
308관 지하 1층
2.	종류
편의점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 미는 문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 편의점 바깥에 있으며 308관 실내와 야외에 각각 존재한다, 실내의자는 모두 이동가능하지만 야외의자는 일체형 의자이다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블 사이 통로가 충분하다, 편의점 내부 공간은 휠체어가 지나다니기에 약간 좁다
5.	장애인화장실 여부
308관 지하 1층에 남녀 장애인 화장실이 존재한다
마. 309관
1. 309관 식당
1.	위치
309관 1층
2.	종류
식당
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 미는 문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구 여부
한 개 존재한다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이의 통로가 좁지만, 대체로 휠체어가 지나다니기에 공간이 충분히 넓다
5.	장애인화장실 여부
309관 1층에 남녀 장애인 화장실이 존재한다
6.	키오스크
키오스크 2대가 존재하지만, 배리어프리한 키오스크가 아니다
2. CU
1.	위치
309관 1층
2.	종류
편의점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 미는 문이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부

2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이의 통로가 좁지만, 대체로 휠체어가 지나다니기에 공간이 충분히 넓다, 무인계산대 높이가 휠체어를 탄 상태로 이용하기에는 약간 높다
5.	장애인화장실 여부
309관 1층에 남녀 장애인 화장실이 존재한다
바. 310관
1. 참슬기
1.	위치
310관 지하 4층
2.	종류
구내식당
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다 (열려있음)
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구
있다, 하지만 계단 존재한다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이 통로가 좁다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애인용칸이 존재하지 않는다
6.	키오스크
키오스크가 여러 대 존재하나 모두 배리어프리한 키오스크가 아니다
2. CAU BURGER
1.	위치
310관 지하 4층
2.	종류
식당 (햄버거, 스낵, 음료수)
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다 (열려있음)
4)	가는 길의 배리어프리 여부
배리어프리하다
5)	별도 출입구
있다, 수동문이다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
내부 공간 적당하다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
6.	키오스크
키오스크가 두 대 존재하나 배리어프리한 키오스크가 아니다
3. 중앙대학교 우편취급국
1.	위치
310관 지하 4층
2.	종류
우체국
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다 (열려있음)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
고정식 의자이다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
내부 공간 적당하다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
4. 헤어앤유
1.	위치
310관 지하 4층
2.	종류
미용실
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
고정식 의자이다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
내부 공간 적당하다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
5. 안경점
1.	위치
310관 지하 4층
2.	종류
안경점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다 (열려있음)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
내부 공간 적당하다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
6. 파머스플라워
1.	위치
310관 지하 4층
2.	종류
꽃집
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
내부 공간이 너무 좁아 휠체어 이동 불가능하다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
7. 모닝글로리
1.	위치
310관 지하 4층
2.	종류
문구점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 자동문이 존재한다 (수동식)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
의자가 없다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
진열대 사이 통로 좁다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
8. 뚜레쥬르
1.	위치
310관 지하 4층
2.	종류
제과점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 자동문이 존재한다 (수동식)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
모든 의자가 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
테이블 사이 통로가 좁다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
9. 310쌀국수
1.	위치
310관 지하 4층
2.	종류
식당
3.	접근성
1)	출입가능여부
출입가능 하지 않다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
주출입구는 충분하지만 휠체어 타고 출입구에서 커브 틀 수 있는 공간이 충분하지 않다, 여닫이문이 존재한다 (열려있음)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
약간 어둡다
3)	내부 공간(eg. 테이블 사이 통로)
테이블 사이 통로 좁다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
10.  세븐일레븐
1.	위치
310관 지하 4층
2.	종류
편의점
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
충분하다, 여닫이문이 존재한다 (수동식)
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
모든 의자 이동 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
진열대 사이 통로 좁다
5.	장애인화장실 여부
남녀 화장실 존재하지만, 별도 장애용칸이 존재하지 않는다
11. Cafe Dream
1.	위치
310관 1층
2.	종류
카페
3.	접근성
1)	출입가능여부
출입가능하다
2)	턱 유무 및 높낮이
턱이 존재하지 않는다
3)	주출입구 및 통로 너비
개방형이다
4)	가는 길의 배리어프리 여부
배리어프리하다
4.	내부
1)	의자 이동 가능 여부
일부만 이동이 가능하다
2)	조명 밝기
적당하다
3)	내부 공간(eg. 테이블 사이 통로)
일부 테이블 사이 통로 좁다
5.	장애인화장실 여부
310관 1층 남녀 장애인화장실 존재
6.	키오스크
키오스크 두 대 존재한다 (장애인용 아님)

제작: 중앙대학교 서울캠퍼스 64대 비상대책위원회 장애인권위원회

"""
import re
import json

conv_dic = {}
delimiter = r"\s*(?:가\. 102관|나\. 301관|다\. 303관|라\. 308관|마\. 309관|바\. 310관)\s*" #관 기준으로 요소 나누기
conv_list = re.split(delimiter, conv) #conv_list[0]부터[5]까지 있음  

key = ['가. 102관', '나. 301관', '다. 303관', '라. 308관', '마. 309관', '바. 310관']

for i in range(6):
  conv_dic[key[i]] = conv_list[i+1] #관 키 딕셔너리 만들기

delimiter2 = r"\s*(?:1\. |2\. |3\. |4\. |5\. |6\. |7\. |8\. |9\. |10\. |11\. )\s*"
for j in range(6):
  conv_dic[key[j]] = re.split(delimiter2, conv_dic[key[j]])
  conv_dic[key[j]] = list(filter(lambda x: x.strip(), conv_dic[key[j]])) #각 편의시설 정보 리스트로 만듦, 각 관 키

result_dic = {}

for key, value in conv_dic.items():
    sub_dic = {}
    for item in value:
        item_info = item.split('\n') # 개행을 기준으로 각 정보를 분리
        item_name = item_info[0] # 첫 번째 요소는 편의시설 이름
        item_details = item_info[1:] # 나머지 요소는 편의시설 상세 정보
        sub_dic[item_name] = item_details # 편의시설 이름을 키로 하고, 상세 정보를 값으로 하는 딕셔너리 생성
    result_dic[key] = sub_dic # 각 관을 키로 하고, 위에서 생성한 딕셔너리를 값으로 하는 딕셔너리 생성



bilding = '가. 101관\n1) 휠체어가 건물에 접근 가능하다. 정문과 왼쪽 입구에는 턱이 있으며 오른쪽 입구에 경사로가 있어서 휠체어가 진입 가능하다.\n2) 건물 내에서 휠체어 이용이 불가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 남녀공용으로 1층 입학처 옆 내리막길로 내려가면 장애인 화장실 있다.\n5) 건물에 장애인 전용 주차장이 존재하지 않는다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재하지 않는다.\n7) 엘리베이터 버튼을 누를 때 음성 안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 없다.\n-\n나. 102관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 지하 1층과 지상 1층에 있다. 남자 장애인 화장실이 지하 1층과 지상 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n다. 103관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층에 있다. 남자 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n라. 104관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 3층에 있다. 남자 장애인 화장실이 2층에 있다.\n5) 건물에 장애인 전용 주차장이 존재하지 않는다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n마. 105관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 없다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n바. 106관\n1) 휠체어가 건물에 접근 불가능하다. 정문으로는 접근이 불가능하며 105관과 이어진 구름사다리를 통해 접근이 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 3층에 있다. 남자 장애인 화장실이 4층에 있다.\n5) 건물에 장애인 전용 주차장이 존재하지 않는다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n사. 107관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 2층에 있다. 남자 장애인 화장실이 없다.\n5) 건물에 장애인 전용 주차장이 존재하지 않는다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n아. 201관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실이 존재하지 않는다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 2층에 있다. 남자 장애인 화장실이 2층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재하지 않는다. \n7) 엘리베이터 버튼을 누를 때 음성 안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 없다.\n9) 건물 내 모든 업무실마다 점자 명판이 부착되어 있다. 2층 여자 장애인 화장실 입구가 좁아서 휠체어 이동이 어렵다.\n-\n자. 202관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 2층에 있다. 남자 장애인 화장실이 2층에 있다. 건물 내 엘리베이터가 없으므로 장애인 화장실로 휠체어 접근이 사실상 불가능하다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 건물에 엘리베이터가 존재하지 않는다.\n-\n차. 203관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 3층에 있다. 남자 장애인 화장실이 4층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n카. 204관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층 제1열람실에 있다. 남자 장애인 화장실이 1층 제2열람실에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n9) 대출자료실에 장애인용 키오스크가 존재한다.\n-\n타. 207관\n1) 휠체어가 건물에 접근 가능하다. 후문은 출입이 가능하며 정문은 출입이 불가능하다.\n2) 건물 내에서 휠체어 이용이 불가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 2층에 있다. 남자 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n9) 대부분의 층에 복층 혹은 턱이 존재하기에 건물 내에서 휠체어 이동이 어렵다. 동아리실이 있는 지하층으로 이어진 엘리베이터가 없기에 지하층으로 휠체어 접근이 불가능하다.\n-\n파. 208관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 불가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층에 있다. 남자 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n하. 209관\n1) 휠체어가 건물에 접근 가능하다.\n2) 휠체어 이용이 가능하다. 지하 2층을 제외한 건물 내 모든 곳에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층에 있다. 남자 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다. 207관과 주차장을 공유한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n9) 지하 2층으로 이어진 엘리베이터가 없기에 지하 2층으로 휠체어 접근이 불가능하다.\n-\n거. 301관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 없다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n너. 302관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층에 있다. 남자 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n더. 303관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 1층, 3층, 5층, 7층, 9층, 11층, 13층에 있다. 남자 장애인 화장실이 지하 1층, 2층, 4층, 6층, 8층, 10층, 12층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 5대 중 2대의 버튼에 점자가 있다.\n-\n러. 304관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다.\n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 없다.\n5) 건물에 장애인 전용 주차장이 존재하지 않는다.\n6) 건물에 엘리베이터가 존재하지 않는다.\n-\n머. 305관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있지 않다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 4층, 6층에 있다. 남자 장애인 화장실이 1층, 5층, 7층에 있다. 남녀 공용 장애인 화장실이 1층에 있다.\n5) 건물에 장애인 전용 주차장이 지하 2층에 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 있다.\n8) 엘리베이터 버튼에 점자가 있다.\n-\n버. 310관\n1) 휠체어가 건물에 접근 가능하다.\n2) 건물 내에서 휠체어 이용이 가능하다. \n3) 건물 내 강의실마다 점자 명판이 부착되어 있다.\n4) 건물 내 장애인 화장실이 있다. 여자 장애인 화장실이 지하6층, 지하5층, 지하3층, 지하2층, 지하1층, 1층, 3층, 4층, 5층, 6층, 7층, 8층, 9층에 있다. 남자 장애인 화장실이 지하6층, 지하5층, 지하3층, 지하2층, 지하1층, 1층, 3층, 4층, 5층, 6층, 7층, 8층, 9층에 있다.\n5) 건물에 장애인 전용 주차장이 존재한다.\n6) 휠체어가 이용 가능한 엘리베이터가 존재한다.\n7) 엘리베이터 버튼을 누를 때 음성안내기능이 없다.\n8) 엘리베이터 버튼에 점자가 있다.'

bilding_list = []
bilding_list = bilding.split("\n-")
bilding_dic = {}

bilding_key = ['가. 101관','나. 102관','다. 103관','라. 104관','마. 105관','바. 106관','사. 107관','아. 201관','자. 202관','차. 203관','카. 204관','타. 207관','파. 208관','하. 209관','거. 301관','너. 302관','더. 303관','러. 304관','머. 305관','버. 310관']
for q in range(20):
  bilding_dic[bilding_key[q]] = bilding_list[q].strip() #관 키 딕셔너리 만들기
  bilding_dic[bilding_key[q]] = bilding_dic[bilding_key[q]].split('\n')

toilet = {}
for w in range(20):
  toilet[bilding_key[w]] = bilding_dic[bilding_key[w]][4] #화장실 딕셔너리
  toilet[bilding_key[w]] = toilet[bilding_key[w]][17:]
toilet_dic = {}
toilet_dic['장애인 화장실'] = toilet

final_dic = {}
result_dic.update(toilet_dic)
final_dic.update(result_dic)
final_dic.update(bilding_dic)

conv_data = json.dumps(final_dic)

with open('conv_data.json', 'w') as file:
  file.write(conv_data)

